model {
  faster_rcnn {
    number_of_stages: 2
    num_classes: 2
    image_resizer {
      fixed_shape_resizer {
        height: 968
        width: 512
      }
    }
    feature_extractor {
      type: "faster_rcnn_pnas"
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        height_stride: 16
        width_stride: 16
        scales: 0.25
        scales: 0.5
        scales: 1.0
        scales: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 1.0
        aspect_ratios: 2.0
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.00999999977648
        }
      }
    }
    first_stage_minibatch_size: 8
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.699999988079
    first_stage_max_proposals: 300
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 17
    maxpool_kernel_size: 1
    maxpool_stride: 1
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        use_dropout: false
        dropout_keep_probability: 1.0
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.300000011921
        iou_threshold: 0.600000023842
        max_detections_per_class: 28
        max_total_detections: 32
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
  }
}
train_config {
  batch_size: 1
  data_augmentation_options {
    gray_to_rgb {
    }
    random_horizontal_flip {
    }
    random_vertical_flip {
    }
    random_adjust_brightness {
    }
    random_adjust_contrast {
    }
    random_adjust_hue {
    }
    random_adjust_saturation {
    }
    random_crop_image {
    }
  }
  optimizer {
    momentum_optimizer {
      learning_rate {
        manual_step_learning_rate {
          initial_learning_rate: 0.000300000014249
          schedule {
            step: 1
            learning_rate: 0.000300000014249
          }
          schedule {
            step: 900000
            learning_rate: 2.99999992421e-05
          }
          schedule {
            step: 1200000
            learning_rate: 3.00000010611e-06
          }
        }
      }
      momentum_optimizer_value: 0.899999976158
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "/aidata/huangyu/image-pre-trained-models/pnasnet-5_large_2017_12_13/model.ckpt"
  fine_tune_checkpoint_type: "classification"
  num_steps: 200000
}
train_input_reader {
  label_map_path: "/aidata/huangyu/ml_test/xxxxxxxxxxxxxxxxxx.pbtxt"
  tf_record_input_reader {
    input_path: "/aidata/huangyu/tmp/xxxxxxxxxxxx/tfrecord/train-*"
  }
}
eval_config {
  num_examples: 2
  max_evals: 2
  use_moving_averages: false
  eval_interval_secs: 60000
  visualization_export_dir: "/aidata/huangyu/tmp/xxxxxxxxxxx/eval_image/"
  export_path: "/aidata/huangyu/tmp/xxxxxxxxx/eval_rst_json/"
}
eval_input_reader {
  label_map_path: "/aidata/huangyu/ml_test/xxxxxxxx/data/xxxxxxxxxx.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: "/aidata/huangyu/tmp/xxxxxxxxxx/tfrecord/val-*"
  }
}
